#include <stdio.h>

/*
	Äü Á¤·Ä: ºĞÇÒ Á¤º¹ ¾Ë°í¸®ÁòÀÇ ÇÏ³ª·Î, ¸Å¿ì ºü¸¥ ¼öÇà ¼Óµµ
	-ÇÕº´ Á¤·Ä°ú ´Ş¸® Äü Á¤·ÄÀº ¸®½ÃÆ®¸¦ ºñ±ÕµîÇÏ°Ô ºĞÇÒÇÑ´Ù.
	ºĞÇÒ(Divide): ºñ±ÕµîÇÏ°Ô 2°³ÀÇ ºÎºĞ ¹è¿­
	Á¤º¹(COnquer):¼øÈ¯ È£Ãâ ÀÌ¿ëÇÏ¿© ´Ù½Ã ºĞÈ° Á¤º¹ ¹æ¹ı Àû¿ë
	°áÇÕ(Combine):Á¤·ÄµÈ ºÎºĞ ¹è¿­µéÀ» ÇÕº´

	ÀåÁ¡: ¼Óµµ°¡ ºü¸£´Ù, Ãß°¡ ¸Ş¸ğ¸® °ø°£À» ÇÊ¿ä·Î ÇÏÁö ¾Ê´Â´Ù.
	´ÜÁ¡: Á¤·ÄµÈ ¸®½ºÆ®¿¡ ´ëÇØ¼­´Â Äü Á¤·ÄÀÇ ºÒ±ÕÇü ºĞÈ°¿¡ ÀÇÇØ
		¿ÀÈ÷·Á ¼öÇà½Ã°£ÀÌ ´õ ¸¹ÀÌ °É¸°´Ù.

	½Ã°£ º¹Àâµµ: O(n log2 n)

	¹æ¹ı:
	1.pitbotÀ» ¼³Á¤ÇÑ´Ù.
	2.ÇÇ¹ş ±âÁØ ¿À¸¥ÂÊ ÀÌµ¿ÇÏ¸é¼­ Å« °ªÀ» Ã£°í
	3.ÇÇ¹ş ±âÁØ ¿ŞÂÊÀ¸·Î ÀÌµ¿ÇÏ¸é¼­ ÀÛÀº °ªÀ» Ã£¾Æ
	4. Å«°ª°ú ÀÛÀº °ªÀ» ¹Ù²Û´Ù.
	 ¸¸¾à ¾ù°¥¸° »óÇ×ÀÌ¸é ÇÇ¹ş°ª°ú ¹Ù²Û´Ù.
*/


int number = 10;
int data[10] = { 1,10,5,8,7,6,4,3,2,9 };

void quickSort(int *data, int start, int end) {
	if (start >= end) {//¿ø¼Ò°¡ 1°³ÀÎ °æ¿ì
		return;
	}
	int key = start;//Å°´Â Ã¹¹øÀç ¿ø¼Ò
	int i = start + 1; //Å°°ª ¿À¸¥ÂÊ ÇÑÄ­¾¿ ÀÌµ¿
	int j = end; //Å°¯“º¸´Ù ÀÛÀº°ªÀ» Ã£±â À§ÇØ
	int temp;

	while (i <= j) { //¾ù°¥¸± ¶§±îÁö ¹İº¹
		while (data[i] <= data[key]) { //Å° °ªº¸´Ù Å« °ªÀ» ¸¸³¯¶§ ±îÁö
			i++;
		}
		while (data[j] >= data[key] && j>start) { //Å° °ªº¸´Ù ÀÛÀº °ªÀ» ¸¸³¯¶§ ±îÁö
			j--;
		}

		if (i > j) { //ÇöÀç ¾ù°¥¸° »óÅÂ¸é Å°°ª°ú ±³Ã¼
			temp = data[j];
			data[j] = data[key];
			data[key] = temp;
		}
		else {
			temp = data[j];
			data[j] = data[i];
			data[i] = temp;
		}
		
	}
	quickSort(data, start, j - 1);
	quickSort(data, j + 1, end);
}

int main(void) {
	quickSort(data, 0, number - 1);

	for (int i =0; i < number; i++) {
		printf("%d", data[i]);
	}

	return 0;
}